Repository: abdallah-hader/advanced_notepad
Catalog: languages/*/lc_messages/AdvancedNotepad.po
Languages: ar

source: file
ar: ملف

source: edit
ar: تحرير

source: tools
ar: الأدوات

source: about
ar: حول

source: new: ctrl+n
ar: جديد: ctrl+n

source: new window: ctrl+shift+n
ar: نافذة جديدة: ctrl+shift+n

source: open file: ctrl+o
ar: فتح ملف: ctrl+o

source: save: ctrl+s
ar: حفظ: ctrl+s

source: save as: ctrl+shift+s
ar: حفظ كَ: ctrl+shift+s

source: check for updates
ar: التحقق من وجود تحديثات

source: settings: alt+s
ar: الإعدادات: alt+s

source: exit
ar: خروج

source: UnDo: ctrl+z
ar: إلغاء التعديل: ctrl+z

source: cut: ctrl+x
ar: قص: ctrl+x

source: copy: ctrl+c
ar: نسخ: ctrl+c

source: paste: ctrl+v
ar: لصق: ctrl+v

source: add copy: ctrl+d
ar: نسخ إضافي: control+d

source: insert date and time: f5
ar: إدراج التاريخ والوقت: f5

source: Find: ctrl+f
ar: بحث: ctrl+f

source: replace text: ctrl+h
ar: استبدال النص: ctrl+h

source: go to: ctrl+g
ar: الذهاب إلى: ctrl+g

source: translate
ar: ترجمة

source: extract
ar: استخراج

source: links: ctrl+u
ar: الروابط: ctrl+u

source: emails: ctrl+e
ar: البريد الالكتروني: ctrl+e

source: translate the selected text: ctrl+t
ar: ترجمة النص المحدد: ctrl+t

source: Translate the entire file: ctrl+shift+t
ar: ترجمة الملف بأكمله: ctrl+shift+t

source: help file: f1
ar: ملف المساعدة: f1

source: telegram channel
ar: قناة التلجرام

source: contact us
ar: التواصل معنا

source: create heading: alt+h
ar: إنشاء رأس موضوع: alt+h

source: create URL: alt+u
ar: إنشاء رابط: alt+u

source: create list: alt+l
ar: إنشاء قائمة: alt+l

source: create paragraph: alt+p
ar: إنشاء فقرة: alt+p

source: about the program
ar: حول البرنامج

source: help
ar: المساعدة

source: go to line
ar: الذهاب إلى سطر

source: line number
ar: رقم السطر

source: all files(*.*)|*.*|text documents(.txt)|*.txt|python scripts(.py)|*.py|html page(.html)|*.html
ar: كل الملفات(*.*)|*.*|مستندات نصية(.txt)|*.txt|ملفات python(.py)|*.py|صفحة html(.html)|*.html

source: open file
ar: فتح ملف

source: Save As
ar: حفظ كَ

source: text documents(.txt)|*.txt|python scripts(.py)|*.py|html page(.html)|*.html
ar: مستندات نصية(.txt)|*.txt|ملفات python(.py)|*.py|صفحة html(.html)|*.html

source: The file {f} already exists, do you want to replace it?
ar: الملف {f} موجود بالفعل , هل تريد استبداله?

source: file exists
ar: الملف موجود

source: File saved successfully
ar: تم حفظ الملف بنجاح

source: Do you want to save changes to Untitled?
ar: هل تريد حفظ التغييرات إلى "بدون عنوان"؟

source: &cancel
ar: إل&غاء

source: &dont save
ar: &عدم الحفظ

source: &save
ar: &حفظ

source: there is no tabs
ar: لا يوجد علامات تبويب

source: the focus already on the first tab
ar: التركيز بالفعل على علامة التبويب الأولى

source: the focus already on the last tab
ar: التركيز بالفعل على علامة التبويب الأخيرة

source: current active is unsaved tab
ar: النشط الحالي هو علامة تبويب غير محفوظة

source: text restored
ar: تم إستعادة النص

source: select a tab first
ar: قم بتحديد علامة تبويب أولًا

source: tab closed
ar: تم إغلاق علامة التبويب

source: If you close the tab, you can't get it back, do you want to save to a file?
ar: إذا أغلقت علامة التبويب ، فلا يمكنك استعادتها ، هل تريد حفظها في ملف؟

source: If you close the tab, you can't get it back, do you want to save changes?
ar: إذا أغلقت علامة التبويب لا يمكنك استعادتها، هل تريد حفظ التغييرات؟

source: text info
ar: معلومات النص

source: Cannot find the {f} file do you want to create it now?
ar: لم يتم العثور على الملف {f} هل تريد إنشائه الآن؟

source: file not found
ar: لم يتم العثور على الملف

source: cancel
ar: إلغاء

source: no
ar: لا

source: yes
ar: نعم

source: advanced notepad
ar: المفكرة المتقدمة

source: abdallah hayder
ar: عبد الله حيدر

source: name: {name}. version: {version}. author: {author}. description: A text editor designed for screen reader users. This editor makes it easy and smooth to control text files with the many features it offers. Such as the tabs system, save the edited text in the tab, and some ready-made HTML codes. and more.
ar: الإسم: {name}. الإصدار: {version}. المطور: {author}. الوصف: محرر نصوص مصمم لمستخدمي قارئ الشاشة. يعمل هذا المحرر على تسهيل التحكم في الملفات النصية من خلال الميزات العديدة التي يوفرها. مثل نظام علامات التبويب ، حفظ النص المحرر في علامة التبويب وبعض أكواد HTML الجاهزة. والمزيد.

source: An error occurred while trying to get the help file.
ar: حدث خطأ أثناء محاولة الحصول على ملف المساعدة.

source: You must select text to copy.
ar: يجب تحديد نص لنسخه.

source: add copied.
ar: تم النسخ الإضافي.

source: no emails found
ar: لم يتم العثور على بريد الكتروني

source: no links found
ar: لم يتم العثور على روابط

source: emails extractor
ar: مستخرج البريد الالكتروني

source: links extractor
ar: مستخرج الروابط

source: extracted emails
ar: البريد الالكتروني المستخرج

source: extracted links
ar: الروابط المُستخرَجة

source: copy to clipboard
ar: نسخ إلى الحافظة

source: copy all to clipboard
ar: نسخ الكل إلى الحافظة

source: close
ar: إغلاق

source: opening in browser
ar: يتم الفتح بالمتصفح

source: {t} copied to clipboard
ar: تم نسخ {t} إلى الحافظة

source: success
ar: نجاح

source: successfully copied to clipboard
ar: تم النسخ إلى الحافظة بنجاح

source: open in browser
ar: فتح في المتصفح

source: ok
ar: موافق

source: replace text
ar: استبدال النص

source: The text to replace
ar: النص المُراد استبداله

source: replace with
ar: استبدال بِ

source: case sensitive letters
ar: مراعاة حالة الأحرف

source: replace all
ar: استبدال الكل

source: The text given to replace was not found.
ar: لم يتم العثور على النص المعطى للاستبدال.

source: text not found
ar: لم يتم العثور على النص

source: text replaced
ar: تم استبدال النص

source: search
ar: بحث

source: search for?
ar: البحث عن؟

source: Found the next occurrence of text
ar: تم العثور على التكرار التالي للنص

source: No search result was found in the text.
ar: لم يتم العثور على نتيجة بحث في النص.

source: no result found
ar: لم يتم العثور على نتيجة

source: program settings
ar: إعدادات البرنامج

source: sections list, choose what you want to modify its settings from the list below
ar: قائمة الأقسام ، اختر ما تريد تعديل إعداداته من القائمة أدناه

source: general settings
ar: الاعدادات العامة

source: Selected text translation settings
ar: إعدادات ترجمة النص المحدد

source: backup and restore
ar: النسخ الاحتياطي والإستعادة

source: You have changed the program language, and to apply this change you must restart the program, do you want to restart now?
ar: لقد قمت بتغيير لغة البرنامج ، ولتطبيق هذا التغيير يجب إعادة تشغيل البرنامج ، هل تريد إعادة التشغيل الآن؟

source: language changed
ar: تم تغيير اللغة

source: Program language
ar: لغة البرنامج

source: Autosave method
ar: طريقة الحفظ التلقائي

source: When any letter is written
ar: عندما يتم كتابة أي حرف

source: disable
ar: تعطيل

source: when space key pressed
ar: عند الضغط على مفتاح المسافة

source: Separation mark between add copy
ar: علامة الفصل بين النسخ الإضافي.

source: comma
ar: فاصلة

source: new line
ar: سطر جديد

source: nothing
ar: لا شيء

source: space
ar: مسافة

source: check for updates on startup
ar: التحقق من التحديثات عند البدء

source: play sounds when navigate tabs
ar: تشغيل مؤثرات صوتية عند التنقل بين علامات التبويب

source: translate from
ar: الترجمة مِن

source: translate to
ar: الترجمة إلى

source: Get the result by
ar: الحصول على النتيجة بواسطة

source: copy to clipboard only
ar: نسخ إلى الحافظة فقط

source: speech and copy to clipboard
ar: النطق ونسخ إلى الحافظة

source: speech only
ar: النطق فقط

source: auto detect
ar: الإكتشاف التلقائي

source: An error occurred while trying to get the list of languages
ar: حدث خطأ أثناء محاولة الحصول على قائمة اللغات

source: create backup
ar: إنشاء نسخة إحتياطية.

source: restore backup
ar: إستعادة نسخة إحتياطية

source: Text copied to clipboard
ar: تم نسخ النص إلى الحافظة

source: There is no text to translate.
ar: لا يوجد نص لترجمته.

source: translate text
ar: ترجمة النص

source: How would you like to get the translated text?
ar: كيف تريد الحصول على النص المترجم؟

source: Put the text in a new tab
ar: وضع النص في علامة تبويب جديدة

source: Replace text in the current tab
ar: استبدال النص في علامة التبويب الحالية

source: start translate
ar: بدء الترجمة

source: The text is being translated, please wait.
ar: يجري ترجمة النص, يرجى الإنتظار.

source: error
ar: خطأ

source: An error occurred during the translation process, please try again later.
ar: حدث خطأ أثناء عملية الترجمة، يرجى المحاولة مرة أخرى في وقت لاحق.

source: The text has been translated successfully.
ar: تمت ترجمة النص بنجاح.

source: checking for updates.
ar: يتم البحث عن تحديثات.

source: unable to access the update service, there may be a temporary problem, or a problem with your connection, make sure you are connected to the Internet and then try again later.
ar: لن نتمكن من الوصول إلى خدمة التحديث ، قد تكون هناك مشكلة مؤقتة ، أو مشكلة في الاتصال الخاص بك ، تأكد من أنك متصل بالإنترنت ثم حاول مرة أخرى لاحقًا.

source: A new update has been found
ar: تم العثور على تحديث جديد

source: There is a new update {name} version {ver} Do you want to update now?
ar: هناك تحديث جديد {name} الإصدار {ver} هل تريد التحديث الآن؟

source: You have the latest version of advanced notepad
ar: لديك أحدث إصدار من المفكرة المتقدمة

source: no updates found
ar: لم يتم العثور على تحديثات

source: An error occurred while trying to connect to the update service, please try again later
ar: حدث خطأ أثناء محاولة الاتصال بخدمة التحديثات، يرجى المحاولة مرة أخرى لاحقًا

source: connection error
ar: خطأ بالإتصال

source: downloading updates
ar: يتم تحميل التحديثات

source: download status
ar: حالة التحميل

source: stop download
ar: إيقاف التحميل

source: An error occurred during the update process, please try again later.
ar: حدث خطأ أثناء عملية التحديث، يرجى المحاولة مرة أخرى في وقت لاحق.

source: downloading update {p}
ar: يتم تحميل التحديث {p}

source: Update downloaded successfully, click OK to start the installation process.
ar: تم تنزيل التحديث بنجاح ، انقر فوق "موافق" لبدء عملية التثبيت.

source: installing update
ar: يتم تثبيت التحديث

source: An unexpected error occurred when trying to open the file for installation, try to download the update again, and if the problem persists, contact the developer to solve it
ar: حدث خطأ غير متوقع عند محاولة فتح الملف للتثبيت ، حاول تنزيل التحديث مرة أخرى ، وإذا استمرت المشكلة ، فاتصل بالمطور لحلها

source: create list
ar: إنشاء قائمة

source: items list
ar: قائمة العناصر

source: write the new item here
ar: اكتب العنصر الجديد هنا

source: add
ar: إضافة

source: ordered list
ar: قائمة مرتبة

source: create
ar: إنشاء

source: You must add at least one item.
ar: يجب عليك إضافة عنصر واحد على الأقل.

source: delete item
ar: حذف العنصر

source: edit item
ar: تحرير العنصر

source: Are you sure you want to remove {item} from the list?
ar: هل أنت متأكد بأنك تريد إزالة {item} من القائمة؟

source: create paragraph
ar: إنشاء فقرة

source: paragraph text
ar: نص الفقرة

source: You must write a text
ar: يجب عليك كتابة نص.

source: create URL
ar: إنشاء رابط

source: Choose the type of URL
ar: اختر نوع الرابط

source: URL button
ar: زر رابط

source: normal URL
ar: رابط عادي

source: image URL
ar: رابط صورة

source: name
ar: الإسم

source: URL
ar: الرابط

source: the URL open in new tab
ar: الرابط يُفتح في علامة تبويب جديدة

source: You must type the URL.
ar: يجب عليك كتابة الرابط.

source: This field is required.
ar: هذا الحقل مطلوب

source: create heading
ar: إنشاء رأس موضوع

source: heading level
ar: مستوى رأس الموضوع

source: the heading text
ar: نص رأس الموضوع

source: select folder to save the new backup file
ar: حدد مجلدًا لحفظ ملف النسخة الاحتياطية الجديد

source: Backup created successfully, the backup path: {p}
ar: تم إنشاء نسخة إحتياطية بنجاح، مسار النسخة الاحتياطية: {p}

source: choos a backup to restore
ar: إختر نسخة إحتياطية لإستعادتها.

source: If you click Yes: the selected backup will be restored, and you cannot undo this action. Are you sure you want to restore the backup?
ar: إذا قمت بالنقر فوق "نعم": ستتم استعادة النسخة الاحتياطية المحددة ، ولا يمكنك التراجع عن هذا الإجراء. هل أنت متأكد أنك تريد استعادة النسخة الاحتياطية؟

source: warning
ar: تحذير

source: The backup has been successfully restored, click OK to restart the program.
ar: تمت استعادة النسخة الاحتياطية بنجاح ، انقر فوق "موافق" لإعادة تشغيل البرنامج.

source: You have selected an invalid backup
ar: لقد اخترت نسخة احتياطية غير صالحة

source: there is no text to get its info.
ar: لا يوجد نص للحصول على معلوماته

source: emails count: {c}.
ar: عدد البريد الألكتروني: {c}

source: links count: {c}.
ar: عدد الروابط: {c}

source: text info: Character count: {charCount}. words count: {wrdCount}. lines count: {lnsCount} Most frequent word: {frequent} Which was repeated {repeted} times. {urlsc} {emailsc}
ar: معلومات النص: عدد الأحرف: {charCount}. عدد الكلمات: {wrdCount}. عدد الأسطر: {lnsCount} الكلمة الأكثر تكرارا: {frequent} التي تكررت {repeted} مِن المرات. {urlsc} {emailsc}

source: The time has been written successfully
ar: تم كتابة الوقت بنجاح

source: new file ({num})
ar: ملف جديد ({num})

source: Keep non existing file
ar: الإحتفاظ بملف غير موجود

source: The file {f} doesn't exist anymore. do you want Keep this file in editor?
ar: الملف {f} لم يعد موجودًا. هل تريد الاحتفاظ بهذا الملف في المحرر؟

source: The translation result is copied to the clipboard.
ar: تم نسخ نتيجة الترجمة إلى الحافظة.
